app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
---
    public function index()

    {

        $data = [
            'titulo' => 'Listando os usuários',
            'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(2),
            'pager'=> $this->usuarioModel->pager,
        ];

UPDATE `usuarios` SET `email` = 'maria@email.com', `id` = '3', `atualizado_em` = '2023-06-02 06:01:48'
WHERE `usuarios`.`id` IN ('3')
---
    public function atualizar($id = null) {

        if ($this->request->getMethod() === 'post')

              {
                  $usuario = $this->buscaUsuarioOu404($id);

                  if ($usuario->deletado_em != null) {

                      return redirect()->back()->with('info', "O usuário $usuario->nome encontra-se excluído. Portanto não é possível editá-lo.");
                  }

                  $post = $this->request->getPost();


                  if(empty($post['password'])) {

                        $this->usuarioModel->desabilitaValidacaoSenha();
                        unset($post['password']);
                        unset($post['password_confirmation']);
                  }


                  $usuario->fill($post);

                  if (!$usuario->hasChanged()){

                     return redirect()->back()->with('info','Não à dados para atualizar!');
                  }

                  if($this->usuarioModel->protect(false)->save($usuario)) {

SELECT *
FROM `usuarios`
WHERE `id` = 3
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1
---
    private function buscaUsuarioOu404 (int $id = null) {

        if (!$id || !$usuario = $this->usuarioModel->withDeleted(true)->where('id', $id)->first()) {